Revit 2027 API
DirectShapeType.RemoveReferenceObject Method
Overload List
Name | Description
RemoveReferenceObject(ExternalGeometryId) |  Removes any reference object associated with the provided ExternalGeometryId from the DirectShapeType. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
RemoveReferenceObject(String) |  Removes any reference objects with the given name from the DirectShapeType. Nothing is done if no reference objects have the given name or if the name is the empty string.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace